tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "autojump"
brew "aws-elasticbeanstalk"
brew "bat"
brew "efm-langserver"
brew "fd"
brew "gawk"
brew "go"
brew "jq"
brew "ripgrep"
brew "stow"
brew "tmux", args: ["HEAD"]
brew "zsh"
cask "font-jetbrains-mono"
cask "kitty"

# neovim dependencies
brew "ninja"
brew "libtool"
brew "automake"
brew "cmake"
brew "pkg-config"
brew "gettext"
